# 3. Напишите программу, которая определит позицию второго вхождения строки 
# в списке либо сообщит, что её нет.
# *Пример:*
# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1
my_list = ["123","234", "12333", "567", "123"]
number = "123"
n = 0
for i, elem in enumerate(my_list):
    if number == elem and n > 0:
        n += n
        print(n)
        print(i)
