# РЕШЕНИЕ ДЛЯ МАК -в системном терминале вот такую команду 
# запустили: python3 -m pip install --upgrade pip  

# РЕШЕНИЕ ДЛЯ WINDOWS - В Windows при установке Python необходимо было установить 
# галочку для установки pip, установить путь Python в 
# папку с:\Program Files, а не в User, и обязательно поставить галочку add PATH
pip install -r requirements.txt # положить в 
# по домашней нужен коментарий! это все нужно сделать???: 
# Создайте программу для игры в ""Крестики-нолики"" при помощи виртуального окружения и PIP
# Прикрутить бота к задачам с предыдущего семинара:
# Создать калькулятор для работы с рациональными и комплексными числами, 
# организовать меню, добавив в неё систему логирования
# Создать телефонный справочник с возможностью импорта и 
# экспорта данных в нескольких форматах.
python3 -m venv .folder
# from os import system
# system('pip install -r requirements.txt') # скачивание библиотек хранящихся в файле requirements.txt
# system('pip freeze > requirements.txt') # сохранение ссылок на библиотеки в файл requirements.txt 
# python3 -m venv venv

/start
/newbot
https://www.pythonanywhere.com/

# Д.З. Сделать бота калькулятор 

