# ## Групповая работа [2]

# Учимся настраивать виртуальное окружение и работать с [PIP](https://pypi.org/)

# В качестве пробы библиотек к программам предыдущего модуля подключить работу с XML \ JSON

# > Для тренировки можно создания телеграм-бота полезные ссылки:
# > 
# > 
# > [https://core.telegram.org/bots](https://core.telegram.org/bots)
# **Задача:** при помощи виртуального окружения и PIP реализовать решение задач 
# с прошлых семинаров:

# 1. Напишите программу, удаляющую из текста все слова, содержащие "абв".
# 2. Создайте программу для игры с конфетами человек против человека.
    
#     Условие задачи: На столе лежит 2021 конфета. Играют два игрока делая ход друг 
# после друга. Первый ход определяется жеребьёвкой. За один ход можно забрать не более 
# чем 28 конфет. Все конфеты оппонента достаются сделавшему последний ход. 
# Сколько конфет нужно взять первому игроку, чтобы забрать все конфеты у своего конкурента?
    
#     a) Добавьте игру против бота
    
#     b) Подумайте как наделить бота "интеллектом"
https://habr.com/ru/post/132554/ # yeld
https://habr.com/ru/company/wunderfund/blog/657355/ # декораторы
