# Напишите программу, которая будет принимать на вход дробь и 
# показывать первую цифру дробной части числа.
f = float(input("Enter float: "))
print((f%10)*10)
